number1 = float(input("Введіть перше число: ")) # float перетворює будь який тип дійсне число => 10.4123; int() перетворює на ціле число 2.34 => 2
number2 = float(input("Введіть друге число: "))

print("Добуток чисел:", number1 * number2)
print("Сума чисел:", number1 + number2)
print("Перше чисел в ступені другого числа:", number1, "в ступені", number2, "=", number1 ** number2)
# оператор ** - Це піднесення в степінь, тобто 2 ** 3 означає 2 в тертьому ступені
# піднесення в ступінь, яка менше за 1 - це корінь з числа. 2^2 = 4, квадратний корінь 4 = 2, 4^0.5
# 16^2 = 256 (16 * 16), 16^0.5 = 4 (16 / 4 = 4)